omnibeesbd/03_SCN005_HotelResRQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://schemas.datacontract.org/2004/07/Pull.BLL.Models" xmlns:ns2="http://tempuri.org/" xmlns:ns3="http://schemas.datacontract.org/2004/07/Pull.BLL.Models.OTA" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns4="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><SOAP-ENV:Body><ns2:SendHotelRes><ns2:login><ns1:Password>WO5bYE2A</ns1:Password><ns1:UserName>BugSoftware</ns1:UserName></ns2:login><ns2:ota_HotelResRQ><ns3:EchoToken>1154782d-ea51-478e-a2c2-02b66b5339c2</ns3:EchoToken><ns3:HotelReservationsType><ns3:HotelReservations><ns3:HotelReservation><ns3:CreateDateTime>0001-01-01T00:00:00</ns3:CreateDateTime><ns3:LastModifyDateTime>0001-01-01T00:00:00</ns3:LastModifyDateTime><ns3:ResGlobalInfo><ns3:CommentsType><ns3:Comments><ns3:Comment><ns3:Description>This is the reservations comments</ns3:Description></ns3:Comment></ns3:Comments></ns3:CommentsType><ns3:Guarantee><ns3:GuaranteesAcceptedType><ns3:GuaranteesAccepted><ns3:GuaranteeAccepted><ns3:GuaranteeID xsi:nil="true"/><ns3:GuaranteeTypeCode>DirectBill</ns3:GuaranteeTypeCode><ns3:PaymentCard><ns3:CardCode>Visa</ns3:CardCode><ns3:CardHolderName>Consumer</ns3:CardHolderName><ns3:CardNumber>4111111111111111</ns3:CardNumber><ns3:EffectiveDate>2019-08-28T12:08:54</ns3:EffectiveDate><ns3:ExpireDate>2021-01-01T00:00:00</ns3:ExpireDate><ns3:SeriesCode>737</ns3:SeriesCode></ns3:PaymentCard></ns3:GuaranteeAccepted></ns3:GuaranteesAccepted></ns3:GuaranteesAcceptedType></ns3:Guarantee><ns3:Total><ns3:AmountAfterTax>811</ns3:AmountAfterTax><ns3:AmountBeforeTax>751</ns3:AmountBeforeTax><ns3:AmountIncludingMarkup>true</ns3:AmountIncludingMarkup><ns3:AmountIsPackage>false</ns3:AmountIsPackage><ns3:ChargeType>PerStay</ns3:ChargeType><ns3:CurrencyCode>BRL</ns3:CurrencyCode></ns3:Total></ns3:ResGlobalInfo><ns3:ResGuestsType><ns3:ResGuests><ns3:ResGuest><ns3:Age>0</ns3:Age><ns3:AgeQualifyingCode>Adult</ns3:AgeQualifyingCode><ns3:PrimaryIndicator>true</ns3:PrimaryIndicator><ns3:Profiles><ns3:ProfileInfos><ns3:ProfileInfo><ns3:Profile><ns3:Customer><ns3:Address><ns3:AddressLine>Rua 25</ns3:AddressLine><ns3:CityCode xsi:nil="true"/><ns3:CountryCode>0</ns3:CountryCode><ns3:PostalCode>8000 Faro</ns3:PostalCode><ns3:StateProvCode>0</ns3:StateProvCode></ns3:Address><ns3:BirthDate>1980-05-01T00:00:00</ns3:BirthDate><ns3:Email>paulo@corp.bug-software.com</ns3:Email><ns3:Gender>Male</ns3:Gender><ns3:PersonName><ns3:GivenName>Ob Adult 1</ns3:GivenName><ns3:MiddleName xsi:nil="true"/><ns3:NamePrefix>None</ns3:NamePrefix><ns3:Surname>Smoth</ns3:Surname></ns3:PersonName></ns3:Customer></ns3:Profile></ns3:ProfileInfo></ns3:ProfileInfos></ns3:Profiles><ns3:ResGuestRPH>1</ns3:ResGuestRPH></ns3:ResGuest><ns3:ResGuest><ns3:Age>0</ns3:Age><ns3:AgeQualifyingCode>Adult</ns3:AgeQualifyingCode><ns3:PrimaryIndicator>false</ns3:PrimaryIndicator><ns3:Profiles><ns3:ProfileInfos><ns3:ProfileInfo><ns3:Profile><ns3:Customer><ns3:Address><ns3:AddressLine>Rua 25</ns3:AddressLine><ns3:CityCode xsi:nil="true"/><ns3:CountryCode>0</ns3:CountryCode><ns3:PostalCode>8000 Faro</ns3:PostalCode><ns3:StateProvCode>0</ns3:StateProvCode></ns3:Address><ns3:BirthDate>1980-05-01T00:00:00</ns3:BirthDate><ns3:Email>paulo@corp.bug-software.com</ns3:Email><ns3:Gender>Male</ns3:Gender><ns3:PersonName><ns3:GivenName>Ob Adult 2</ns3:GivenName><ns3:MiddleName xsi:nil="true"/><ns3:NamePrefix>None</ns3:NamePrefix><ns3:Surname>Smoth</ns3:Surname></ns3:PersonName></ns3:Customer></ns3:Profile></ns3:ProfileInfo></ns3:ProfileInfos></ns3:Profiles><ns3:ResGuestRPH>2</ns3:ResGuestRPH></ns3:ResGuest></ns3:ResGuests></ns3:ResGuestsType><ns3:ResStatus><ns3:PMS_ResStatusType xsi:nil="true"/><ns3:TransactionActionType>Book</ns3:TransactionActionType></ns3:ResStatus><ns3:RoomStaysType><ns3:MoreIndicator>false</ns3:MoreIndicator><ns3:RoomStays><ns3:RoomStay><ns3:RoomStayLanguage>en</ns3:RoomStayLanguage><ns3:WarningRPH xsi:nil="true"/><ns3:BasicPropertyInfo><ns3:CurrencyCode xsi:nil="true"/><ns3:HotelRef><ns3:ChainCode>986</ns3:ChainCode><ns3:HotelCode>1053</ns3:HotelCode></ns3:HotelRef></ns3:BasicPropertyInfo><ns3:CommentsType><ns3:Comments><ns3:Comment><ns3:Description>This is my room comment</ns3:Description><ns3:Language xsi:nil="true"/></ns3:Comment></ns3:Comments></ns3:CommentsType><ns3:GuestCountsType><ns3:GuestCounts><ns3:GuestCount><ns3:Age xsi:nil="true"/><ns3:AgeQualifyCode>Adult</ns3:AgeQualifyCode><ns3:Count>2</ns3:Count><ns3:ResGuestRPH><ns4:int>1</ns4:int><ns4:int>2</ns4:int></ns3:ResGuestRPH></ns3:GuestCount></ns3:GuestCounts></ns3:GuestCountsType><ns3:RPH>0</ns3:RPH><ns3:RatePlans><ns3:RatePlanType><ns3:AdditionalDetailsType/><ns3:CancelPenalties><ns3:CancelPenalty><ns3:AmountPercent><ns3:CurrencyCode xsi:nil="true"/></ns3:AmountPercent><ns3:DeadLine><ns3:AbsoluteDeadline xsi:nil="true"/><ns3:OffsetUnitMultiplier xsi:nil="true"/></ns3:DeadLine><ns3:End xsi:nil="true"/><ns3:PenaltyDescription><ns3:Description xsi:nil="true"/><ns3:Language xsi:nil="true"/><ns3:Name xsi:nil="true"/></ns3:PenaltyDescription><ns3:Start xsi:nil="true"/></ns3:CancelPenalty></ns3:CancelPenalties><ns3:CurrencyCode xsi:nil="true"/><ns3:EffectiveDate xsi:nil="true"/><ns3:ExpireDate xsi:nil="true"/><ns3:Guarantees><ns3:Guarantee/></ns3:Guarantees><ns3:MealsIncluded><ns3:Breakfast>true</ns3:Breakfast><ns3:Description>Breakfast</ns3:Description><ns3:Dinner>false</ns3:Dinner><ns3:ID>3068</ns3:ID><ns3:Lunch>false</ns3:Lunch><ns3:MealPlanCode>BedBreakfast</ns3:MealPlanCode><ns3:MealPlanIndicator>true</ns3:MealPlanIndicator><ns3:Name>Breakfast</ns3:Name></ns3:MealsIncluded><ns3:Offers><ns3:Offer><ns3:CompatibleOffer><ns3:CompatibleOffer/></ns3:CompatibleOffer><ns3:Description><ns3:Description>7=6</ns3:Description><ns3:Language>en</ns3:Language></ns3:Description><ns3:Discount><ns3:AmountBeforeTax xsi:nil="true"/><ns3:ChargeUnitCode>PerRoomPerStay</ns3:ChargeUnitCode><ns3:DiscountCode xsi:nil="true"/><ns3:DiscountPattern>0000001</ns3:DiscountPattern><ns3:DiscountReason xsi:nil="true"/><ns3:NightsDiscounted>1</ns3:NightsDiscounted><ns3:NightsRequired>7</ns3:NightsRequired><ns3:Percent xsi:nil="true"/></ns3:Discount><ns3:OfferCode>535#0</ns3:OfferCode><ns3:OfferRules><ns3:OfferRule><ns3:LengthsOfStay xsi:nil="true"/><ns3:MaxAdvancedBookingOffset xsi:nil="true"/><ns3:MinAdvancedBookingOffset xsi:nil="true"/></ns3:OfferRule></ns3:OfferRules><ns3:RPH>535#0</ns3:RPH></ns3:Offer></ns3:Offers><ns3:RatePlanDescription><ns3:Description></ns3:Description><ns3:Language>en</ns3:Language></ns3:RatePlanDescription><ns3:RatePlanID>1</ns3:RatePlanID><ns3:RatePlanName>BAR NET Com</ns3:RatePlanName><ns3:RatePlanTypeCode>25</ns3:RatePlanTypeCode><ns3:SortOrder>1</ns3:SortOrder><ns3:TaxPolicies><ns3:TaxPolicy><ns3:CurrencyCode>BRL</ns3:CurrencyCode><ns3:Description>Of 5%</ns3:Description><ns3:ID>82</ns3:ID><ns3:IsPerNight>false</ns3:IsPerNight><ns3:IsPerPerson>false</ns3:IsPerPerson><ns3:IsPerRoom>true</ns3:IsPerRoom><ns3:IsPerStay>true</ns3:IsPerStay><ns3:IsValuePercentage>true</ns3:IsValuePercentage><ns3:Name>ISS rate</ns3:Name><ns3:Value>5.00</ns3:Value></ns3:TaxPolicy><ns3:TaxPolicy><ns3:CurrencyCode>BRL</ns3:CurrencyCode><ns3:Description>Taxa aplicada por pessoa e por noite.</ns3:Description><ns3:ID>809</ns3:ID><ns3:IsPerNight>true</ns3:IsPerNight><ns3:IsPerPerson>true</ns3:IsPerPerson><ns3:IsPerRoom>false</ns3:IsPerRoom><ns3:IsPerStay>false</ns3:IsPerStay><ns3:IsValuePercentage>true</ns3:IsValuePercentage><ns3:Name>Tax Test 1</ns3:Name><ns3:Value>3.00</ns3:Value></ns3:TaxPolicy></ns3:TaxPolicies></ns3:RatePlanType></ns3:RatePlans><ns3:RoomRates><ns3:RoomRate><ns3:EffectiveDate>2020-07-06T00:00:00</ns3:EffectiveDate><ns3:ExpireDate>2020-07-13T00:00:00</ns3:ExpireDate><ns3:RatePlanID>23570</ns3:RatePlanID><ns3:RatesType><ns3:Rates><ns3:Rate><ns3:EffectiveDate>2020-07-06T00:00:00</ns3:EffectiveDate><ns3:MaxLOS xsi:nil="true"/><ns3:MinLOS xsi:nil="true"/><ns3:Total><ns3:AmountAfterTax>0</ns3:AmountAfterTax><ns3:AmountBeforeTax>125</ns3:AmountBeforeTax><ns3:AmountIncludingMarkup>true</ns3:AmountIncludingMarkup><ns3:AmountIsPackage>false</ns3:AmountIsPackage><ns3:ChargeType>PerRoomPerNight</ns3:ChargeType><ns3:CurrencyCode>BRL</ns3:CurrencyCode></ns3:Total></ns3:Rate><ns3:Rate><ns3:EffectiveDate>2020-07-07T00:00:00</ns3:EffectiveDate><ns3:MaxLOS xsi:nil="true"/><ns3:MinLOS xsi:nil="true"/><ns3:Total><ns3:AmountAfterTax>0</ns3:AmountAfterTax><ns3:AmountBeforeTax>125</ns3:AmountBeforeTax><ns3:AmountIncludingMarkup>true</ns3:AmountIncludingMarkup><ns3:AmountIsPackage>false</ns3:AmountIsPackage><ns3:ChargeType>PerRoomPerNight</ns3:ChargeType><ns3:CurrencyCode>BRL</ns3:CurrencyCode></ns3:Total></ns3:Rate><ns3:Rate><ns3:EffectiveDate>2020-07-08T00:00:00</ns3:EffectiveDate><ns3:MaxLOS xsi:nil="true"/><ns3:MinLOS xsi:nil="true"/><ns3:Total><ns3:AmountAfterTax>0</ns3:AmountAfterTax><ns3:AmountBeforeTax>125</ns3:AmountBeforeTax><ns3:AmountIncludingMarkup>true</ns3:AmountIncludingMarkup><ns3:AmountIsPackage>false</ns3:AmountIsPackage><ns3:ChargeType>PerRoomPerNight</ns3:ChargeType><ns3:CurrencyCode>BRL</ns3:CurrencyCode></ns3:Total></ns3:Rate><ns3:Rate><ns3:EffectiveDate>2020-07-09T00:00:00</ns3:EffectiveDate><ns3:MaxLOS xsi:nil="true"/><ns3:MinLOS xsi:nil="true"/><ns3:Total><ns3:AmountAfterTax>0</ns3:AmountAfterTax><ns3:AmountBeforeTax>125</ns3:AmountBeforeTax><ns3:AmountIncludingMarkup>true</ns3:AmountIncludingMarkup><ns3:AmountIsPackage>false</ns3:AmountIsPackage><ns3:ChargeType>PerRoomPerNight</ns3:ChargeType><ns3:CurrencyCode>BRL</ns3:CurrencyCode></ns3:Total></ns3:Rate><ns3:Rate><ns3:EffectiveDate>2020-07-10T00:00:00</ns3:EffectiveDate><ns3:MaxLOS xsi:nil="true"/><ns3:MinLOS xsi:nil="true"/><ns3:Total><ns3:AmountAfterTax>0</ns3:AmountAfterTax><ns3:AmountBeforeTax>125</ns3:AmountBeforeTax><ns3:AmountIncludingMarkup>true</ns3:AmountIncludingMarkup><ns3:AmountIsPackage>false</ns3:AmountIsPackage><ns3:ChargeType>PerRoomPerNight</ns3:ChargeType><ns3:CurrencyCode>BRL</ns3:CurrencyCode></ns3:Total></ns3:Rate><ns3:Rate><ns3:EffectiveDate>2020-07-11T00:00:00</ns3:EffectiveDate><ns3:MaxLOS xsi:nil="true"/><ns3:MinLOS xsi:nil="true"/><ns3:Total><ns3:AmountAfterTax>0</ns3:AmountAfterTax><ns3:AmountBeforeTax>125</ns3:AmountBeforeTax><ns3:AmountIncludingMarkup>true</ns3:AmountIncludingMarkup><ns3:AmountIsPackage>false</ns3:AmountIsPackage><ns3:ChargeType>PerRoomPerNight</ns3:ChargeType><ns3:CurrencyCode>BRL</ns3:CurrencyCode></ns3:Total></ns3:Rate><ns3:Rate><ns3:EffectiveDate>2020-07-12T00:00:00</ns3:EffectiveDate><ns3:MaxLOS xsi:nil="true"/><ns3:MinLOS xsi:nil="true"/><ns3:Total><ns3:AmountAfterTax>0</ns3:AmountAfterTax><ns3:AmountBeforeTax>0</ns3:AmountBeforeTax><ns3:AmountIncludingMarkup>true</ns3:AmountIncludingMarkup><ns3:AmountIsPackage>false</ns3:AmountIsPackage><ns3:ChargeType>PerRoomPerNight</ns3:ChargeType><ns3:CurrencyCode>BRL</ns3:CurrencyCode></ns3:Total></ns3:Rate></ns3:Rates></ns3:RatesType><ns3:RoomID>2982</ns3:RoomID><ns3:RoomStayCandidateRPH>0</ns3:RoomStayCandidateRPH><ns3:Total><ns3:AmountAfterTax>810.00</ns3:AmountAfterTax><ns3:AmountBeforeTax>750</ns3:AmountBeforeTax><ns3:AmountIncludingMarkup>true</ns3:AmountIncludingMarkup><ns3:AmountIsPackage>false</ns3:AmountIsPackage><ns3:ChargeType>PerRoomPerStay</ns3:ChargeType><ns3:CurrencyCode>BRL</ns3:CurrencyCode></ns3:Total></ns3:RoomRate></ns3:RoomRates><ns3:RoomTypes><ns3:RoomType><ns3:NumberOfUnits>18</ns3:NumberOfUnits><ns3:Occupancies><ns3:Occupancy><ns3:AgeQualifyingCode>Adult</ns3:AgeQualifyingCode><ns3:MaxAge xsi:nil="true"/><ns3:MaxOccupancy>2</ns3:MaxOccupancy><ns3:MinAge xsi:nil="true"/><ns3:MinOccupancy>1</ns3:MinOccupancy></ns3:Occupancy><ns3:Occupancy><ns3:AgeQualifyingCode>Child</ns3:AgeQualifyingCode><ns3:MaxAge xsi:nil="true"/><ns3:MaxOccupancy>1</ns3:MaxOccupancy><ns3:MinAge xsi:nil="true"/><ns3:MinOccupancy>1</ns3:MinOccupancy></ns3:Occupancy></ns3:Occupancies><ns3:RoomDescription><ns3:Description xsi:nil="true"/><ns3:Language xsi:nil="true"/></ns3:RoomDescription><ns3:RoomID>1</ns3:RoomID><ns3:RoomName xsi:nil="true"/></ns3:RoomType></ns3:RoomTypes><ns3:SpecialRequestsType><ns3:SpecialRequests><ns3:SpecialRequest><ns3:Description>This is my room special request</ns3:Description></ns3:SpecialRequest></ns3:SpecialRequests></ns3:SpecialRequestsType><ns3:Total><ns3:AmountAfterTax>810.00</ns3:AmountAfterTax><ns3:AmountBeforeTax>750</ns3:AmountBeforeTax><ns3:AmountIncludingMarkup>true</ns3:AmountIncludingMarkup><ns3:AmountIsPackage>false</ns3:AmountIsPackage><ns3:ChargeType>PerStay</ns3:ChargeType><ns3:CurrencyCode>BRL</ns3:CurrencyCode></ns3:Total></ns3:RoomStay></ns3:RoomStays></ns3:RoomStaysType></ns3:HotelReservation></ns3:HotelReservations></ns3:HotelReservationsType><ns3:PrimaryLangID>en</ns3:PrimaryLangID><ns3:Target>Test</ns3:Target><ns3:TimeStamp>2019-08-28T12:08:54</ns3:TimeStamp><ns3:Version>2.6</ns3:Version></ns2:ota_HotelResRQ></ns2:SendHotelRes></SOAP-ENV:Body></SOAP-ENV:Envelope>